---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.DecimalSheetLength
source: html/ff3ccaf1-c076-9887-9695-43ea562c80f6.htm
---
# Autodesk.Revit.DB.SpecTypeId.DecimalSheetLength Property

Decimal Sheet Length, in discipline Common.

## Syntax (C#)
```csharp
public static ForgeTypeId DecimalSheetLength { get; }
```